package MyPro07.com.xzhao.arrays;

/**
 * 测试二维数组
 * @author 施克箭
 * 
 ***栈内存***              *** 堆内存***
 *************     *****************************
 *           *     *                           *
 *           *     *              ->********* *
 *           *     *              |  *a[0][0]* *
 *           *     *              |  ********* *
 *    a--------------->********   |  *a[0][1]* *
 *           *     *   * a[0] *---   ********* *
 *           *     *   ********      *a[0][2]* *
 *           *     *   * a[1] *      ********* *
 *           *     *   ********      *a[0][3]* *
 *           *     *   * a[2] *      ********* *
 *           *     *   ********                *
 *           *     *                           *
 *************     *****************************
 * 
 * 
 */
public class Test2DimensionArrays {
  public static void main(String[] args) {  
  //int[] a = new int[3];
  //Car[] cars = new Car[3];
    Car[] cars = {
      new Car(),
      new Car()
    };
  
  //二维数组的声明及动态初始化
    int[][] a = new int[3][];
    //a[0] = {20,39}; //错误，没有声明类型就初始化
    a[0] = new int[24]; //声明有24个元素
    a[1] = new int[]{10,2,5};//动态初始化
    a[2] = new int[]{5,5,3,6};
    
  //二维数组的静态初始化
    int[][] b = {
      {1,2,3},
      {11,22,33},
      {111,222,333}
    };
    
  //
    System.out.println(b[2][2]);

  }
  
  
  
  static class Car{    
  }
}
